In [3]:
import pandas as pd
import numpy as np

In [5]:
titanic = pd.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')
titanic.head()

name
False    449
True     860
Name: name, dtype: int64

In [107]:
names = titanic.name.str.split()
names.groupby((names.str.len()-3)>0).count()

name
False    449
True     860
Name: name, dtype: int64

In [106]:
titanic.groupby("survived").get_group(1).boat
a = titanic[["boat","survived"]].groupby("boat").count().sort_values(by = "survived").tail(1)

      survived
boat
13          39